import Main from "@assets/img/chapter1-main.png";

// 2019-2023
import RussiaIt from "@assets/img/russia-it.png";

// Ситуация на российском ИТ-рынке
import Directions from "@assets/img/directions.png";
// Цифровая экономика
import DigitalProduction1 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-0.png";
import DigitalProduction2 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-1.png";
import DigitalProduction3 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-2.png";
import DigitalProduction4 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-3.png";
import DigitalProduction5 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-4.png";
import DigitalProduction6 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-5.png";
import DigitalProduction7 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-6.png";
import DigitalProduction8 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-7.png";
import DigitalProduction9 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-8.png";
import DigitalProduction10 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-9.png";
import DigitalProduction11 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-10.png";
import DigitalProduction12 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-11.png";
import DigitalProduction13 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-12.png";
import DigitalProduction14 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-13.png";
import DigitalProduction15 from "@assets/img/digital-production/prezentatsiya-tse_mjl6o1Q-14.png";

import Industry40 from "@assets/img/industry4-0.png";
import AI from "@assets/img/AI.png";

import Camino from "@assets/img/camino.jpg";
import UM from "@assets/img/UM.jpg";
import UM1 from "@assets/img/UM1.png";
import UM2 from "@assets/img/UM2.jpg";

import DASH from '@assets/img/DASH.jpg'

import PathRec from "@assets/img/pathrec.png";
import Tourism from "@assets/img/tourism.jpg";
import NewView from "@assets/img/new-view.jpg";

const digitalProductionImages = [
  DigitalProduction1,
  DigitalProduction2,
  DigitalProduction3,
  DigitalProduction4,
  DigitalProduction5,
  DigitalProduction6,
  DigitalProduction7,
  DigitalProduction8,
  DigitalProduction9,
  DigitalProduction10,
  DigitalProduction11,
  DigitalProduction12,
  DigitalProduction13,
  DigitalProduction14,
  DigitalProduction15,
  DigitalProduction1,
];

import D3 from "@assets/img/chapter2/3d.jpg"; 
import Ai from "@assets/img/chapter2/AI.jpg"; 
import Blockchain from "@assets/img/chapter2/blockchain.jpg"; 
import Cloud from "@assets/img/chapter2/cloud.jpg"; 
import Dapps from "@assets/img/chapter2/dapps.jpg"; 
import Decentr from "@assets/img/chapter2/Decentr.jpg"; 
import Defi from "@assets/img/chapter2/defi.jpg"; 
import Metavers from "@assets/img/chapter2/metavers.jpg"; 
import NFT from "@assets/img/chapter2/NFT.jpg"; 

const Web3Section = [
  {
    image: D3,
    text: {
      title: "3D-визуализация и интерактивность",
      text: "Использование 3D-графики и интерфейсов для создания более продвинутых пользовательских взаимодействий, особенно в контексте метавселенных и виртуальной реальности;",
    },
  },
  {
    image: Ai,
    text: {
      title: "Искусственный интеллект и машинное обучение",
      text: "ИИ позволяет системам выполнять задачи, требующие интеллекта, такие как распознавание образов и принятие решений. Машинное обучение обучает системы находить закономерности и делать предсказания на основе данных без явного программирования",
    },
  },
  {
    image: Blockchain,
    text: {
      title: "Блокчейн",
      text: "Реестр для записи транзакций между двумя сторонами и защиты данных внутри транзакций от несанкционированного доступа",
    },
  },
  {
    image: Cloud,
    text: {
      title: "Облачные вычисления",
      text: "Предоставляют распределённые вычислительные ресурсы для хранения и обработки данных, что поддерживает децентрализованные приложения (dApps) и блокчейн-системы",
    },
  },
  {
    image: Dapps,
    text: {
      title: "Децентрализованные приложения",
      text: "Это приложения, которые работают на сетях блокчейна",
    },
  },
  {
    image: Decentr,
    text: {
      title: "Децентрализованное управление данными",
      text: "Хранение и контроль данных не централизованными корпорациями, а распределёнными узлами сети",
    },
  },
  {
    image: Defi,
    text: {
      title: "Децентрализованные финансы",
      text: "Финансовые сервисы, работающие на основе блокчейна, без посредников, таких как банки",
    },
  },
  {
    image: Metavers,
    text: {
      title: "Метавселенные",
      text: "Виртуальные пространства, где пользователи могут взаимодействовать в реальном времени",
    },
  },
  {
    image: NFT,
    text: {
      title: "Токенизация",
      text: "Невзаимозаменяемые записи в блокчейне",
    },
  },
];

import ArVrMr from "@assets/img/arwrmr.png"; 

import Title3 from "@assets/img/title3.jpg";
import Title4 from "@assets/img/title4.png";
import NewTour from "@assets/img/new-tour.jpg";
import Peremena from "@assets/img/peremena.jpg";
import ArVrTourism from "@assets/img/ar-vr-tourism.jpg";
import FutureTourism from "@assets/img/future-tourism.jpg";
import Web3Industry4 from "@assets/img/web3-industry4.jpg";

import ArVrWeb3 from "@assets/img/ar-vr-web3.jpg";

const title1 = {
  titleName: "Введение",
  titleSubName: "Структура глобального ИТ-рынка и ключевые направления",
  titleText:
    "Рынок информационных технологий в 2024 году продолжает свой быстрый рост, и, по оценкам аналитической компании Gartner, объем глобального ИТ-рынка достигнет 5 трлн долларов США, что на 6,8% больше по сравнению с предыдущим годом. Такие высокие темпы роста объясняются широким распространением ИТ-технологий в различных секторах и странами по всему миру, стремящимися к цифровизации и автоматизации.",
  titleImage: Main,
};

const title2 = {
  titleName: "Тренды Web 3.0: Виртуальная, дополненная и смешанная реальности",
  titleSubName: "Новый тренд на развитие жизни",
  titleText:
    "В Web 3.0 технологии AR, VR и MR создают совершенно новый опыт взаимодействия с интернетом.  Каждая из них открывает новые горизонты для пользователей сети, убирая ограничения между людьми из различных уголков нашей планеты.",
  // titleText:
  //   "Как было отмечено ранее, одним из направлений развития в концепции Web 3.0 являются виртуальная (VR), дополненная (AR) и смешанная (MR) реальности. Дадим определения и рассмотрим каждую из них подробнее.",
  titleImage: AI,
};

const ch1_1 = {
  title: "Ситуация на российском ИТ-рынке",
  text: "В России, как и в глобальном масштабе, рынок информационных технологий демонстрирует устойчивый рост, который за период с 2019 по конец 2023 года составил 58%. Основной акцент делается на импортозамещении и цифровизации государственных услуг. Российские компании и государственные структуры активно развивают следующие направления:",
  image: Directions,
};

const ch1_2 = {
  title: "Проект «Цифровая экономика» и автоматизация госуправления",
  text: "На фоне активного развития цифровой инфраструктуры и услуг в России важным фактором стало внедрение национального проекта «Цифровая экономика», в рамках которого государство утверждает внедрение двадцати пяти «суперсервисов». Эти сервисы направлены на упрощение взаимодействия граждан с госструктурами",
  image: digitalProductionImages,
};

const ch1_3 = {
  title: "Влияние ИТ на экономику и рынок труда в России",
  text: "ИТ-сектор в России также позитивно влияет на занятость и экономическое развитие. По мере его роста увеличивается количество рабочих мест, одновременно возрастает и дефицит кадров. Этот спрос подталкивает российские образовательные учреждения к созданию новых программ для подготовки ИТ-специалистов, а курсы и тренинги становятся востребованными среди молодых профессионалов. Однако дефицит кадров в сфере ИТ остается актуальной проблемой.",
  image: RussiaIt,
  source: "Высшая школа экономики",
};

const ch1_4 = {
  title: "Индустрия 4.0: Вектор на цифровую трансформацию промышленности",
  text: "Концепция Индустрии 4.0 ориентирована на интеграцию цифровых технологий в традиционные отрасли, что включает внедрение искусственного интеллекта, Интернета вещей и роботизированных систем. В России компании, такие как «Северсталь» и En+ Group, активно разрабатывают свои цифровые платформы и решения. Например, En+ Group инициировала проект «Лаборатория энергетики-2020», направленный на внедрение интеллектуальных решений в энергетику, а «Сибур» развивает промышленный Интернет вещей (IIoT) и платформу «Удалённый эксперт AR».",
  image: Industry40,
  source: "KUKA Robotics | СНГ",
};

const ch1_5 = {
  title: "Концепция Web 3.0 и её ключевые направления",
  text: "Web 3.0 — это концепция нового поколения интернета, которая ориентируется на децентрализацию и расширенные возможности взаимодействия пользователей с цифровой средой. В отличие от традиционного веба, Web 3.0 основывается на блокчейне, распределённых вычислениях и технологиях искусственного интеллекта, что позволяет пользователям взаимодействовать с контентом, данными и сервисами без посредников.",
  image: Web3Section,
};

const chapterOne = {
  title: title1,
  blocks: [ch1_1, ch1_2, ch1_3, ch1_4, ch1_5],
};

const ch2_1 = {
  title: "Что это вообще такое?",
  text: [
    `Дополненная реальность (AR) — это как волшебство, которое добавляет цифровые объекты в реальный мир. С помощью AR, например, с вашего телефона или планшета могут появляться данные о том, что происходит вокруг. Вы можете смотреть на здание и увидеть на экране описание его истории или виртуальные указатели, которые ведут вас к интересным местам. AR становится неотъемлемой частью нашей повседневной жизни, делая реальность еще более информативной и интерактивной.
`,
    `
  Виртуальная реальность (VR) — это технология, которая позволяет вам полностью погрузиться в другой мир. Всё, что вас окружает, исчезает, и вы оказываетесь в созданной цифровой среде, будь то экзотический остров или историческое место. Чтобы испытать это, нужно использовать специальное оборудование, такое как VR-очки, которые создают иллюзию полного присутствия в другом пространстве. В туризме это может быть виртуальный тур, который позволяет исследовать удаленные уголки мира без необходимости покидать свой дом.
`,
    `
  Смешанная реальность (MR) объединяет как реальный мир, так и виртуальные объекты, но с возможностью взаимодействия с ними. Это не просто дополнение, а полноценный опыт, где вы можете «трогать» и взаимодействовать с виртуальными элементами, которые выглядят и ведут себя как настоящие. Например, с помощью специальных гарнитур MR вы можете «посетить» музей и взаимодействовать с историческими экспонатами, которые в реальности не существуют. 
`,
  ],
  image: ArVrMr,
};

const ch2_2 = {
  title: "Роль AR, VR и MR в Web 3.0",
  text: 'Технологии виртуальной, дополненной и смешанной реальности занимают ключевое место в Web 3.0, создавая новые способы для взаимодействия с цифровой реальностью:Дополненная реальность (AR). AR накладывает цифровые объекты на реальный мир, предоставляя пользователю дополнительную информацию или возможности взаимодействия с окружающей средой.Виртуальная реальность (VR). VR позволяет пользователям полностью погружаться в цифровую среду, используя устройства для иммерсивного опыта, например VR-очки.Смешанная реальность (MR). MR соединяет реальный и виртуальный миры, позволяя пользователям взаимодействовать с виртуальными объектами через специальные гарнитуры.',
  image: ArVrWeb3
};

const chapterTwo = {
  title: title2,
  blocks: [ch2_1, ch2_2],
  isWhite: true,
};

const title3 = {
  titleName: "Web3 в области туризма",
  titleSubName: "Что такое Web 3.0 в контексте туризма?",
  titleText:
    "В первую очередь, Web 3.0 в туризме — это удобство и персонализация. Вместо того чтобы искать информацию в десятках разных сервисов и платформ, туристы смогут получить всё необходимое в одном месте. Это касается как бронирования отелей и билетов, так и организации культурных мероприятий. С помощью новых технологий путешествия становятся не просто удобными, но и гораздо более безопасными, а самое главное — персонализированными под нужды каждого туриста.",
  titleImage: Title3,
};

const ch3_1 = {
  title: "Децентрализация и безопасность с блокчейном",
  text: "Блокчейн, который лежит в основе Web 3.0, уже сегодня активно внедряется в туристическую отрасль. Например, с помощью блокчейн-платформы можно отслеживать и удостоверять информацию о туристических продуктах, защищать транзакции и взаимодействовать с различными сервисами без посредников. Платформы, такие как Camino Network, предоставляют возможность путешественникам использовать смарт-контракты, обеспечивая безопасность и прозрачность сделок.",
  // text: "С увеличением трудностей для выезда за границу, внутренний туризм в России стал особенно актуален. В последние годы развивается большое количество сервисов, направленных на предоставление культурно-досуговых услуг, таких как бронирование билетов, отелей, а также организация культурных мероприятий. Например, проект «Туризм и индустрия гостеприимства», подписанный в 2021 году, направлен на поддержку и развитие внутреннего туризма в России. В рамках этого проекта был обновлён Национальный Туристический Портал “Russia.Travel”, который предоставляет удобные инструменты для путешественников.",
  image: Camino,
};

const ch3_2 = {
  title: "Виртуальные путешествия и AR/VR",
  text: "Но, пожалуй, самой захватывающей частью Web 3.0 в туризме является использование дополненной и виртуальной реальности. Представьте, что вы можете прогуляться по историческим местам, не выходя из дома, или перед поездкой поехать в виртуальный тур, чтобы «ощутить» атмосферу города. В Москве уже реализованы проекты, такие как «Узнай Москву», где дополненная реальность помогает узнать о значимых достопримечательностях столицы. А в парке «Зарядье» при помощи VR можно виртуально посетить различные уголки города, что позволяет не только ознакомиться с местами до поездки, но и улучшить впечатления от реального путешествия.",
  // text: "Технологии AR и VR уже значительно изменили способ взаимодействия с туристическими услугами. Виртуальные туры и улучшение впечатлений от реальных путешествий с помощью этих технологий становятся неотъемлемой частью туристической индустрии. Примером может служить проект «Узнай Москву», в котором построены маршруты с использованием дополненной реальности для улучшения путешествия по столице. Кроме того, в парке «Зарядье» активно используются VR-технологии, позволяющие туристам виртуально прогуляться по знаменитым местам Москвы. Такой подход позволяет путешественникам исследовать достопримечательности перед реальной поездкой или получать дополнительные данные об объектах во время визита.",
  image: [UM, UM1, UM2],
};

const ch3_3 = {
  title: "Искусственный интеллект: туризм, который знает тебя",
  text: "Если раньше, чтобы выбрать лучшие маршруты или отели, нам приходилось искать информацию в интернете, то с развитием ИИ и машинного обучения, всё это будет делать система за нас. Рекомендательные сервисы, такие как «PathRec», анализируют предпочтения путешественников и предлагают им наиболее подходящие варианты маршрутов, отелей и развлечений. Также активно используются голосовые помощники, как, например, в авиакомпаниях, где системы ИИ помогают путешественникам организовать поездки, предоставлять информацию о рейсах или отвечать на часто задаваемые вопросы.",
  image: PathRec,
  // text: "Одной из наиболее перспективных технологий Web 3.0 для туризма является блокчейн. Например, блокчейн-платформа Camino Network, ориентированная на туристов, предоставляет возможность создавать и развёртывать децентрализованные приложения с использованием смарт-контрактов. Такая технология объединяет в себе несколько трендов Web 3.0, включая децентрализованные финансы (DeFi), цифровые идентификаторы и автономные организации (DAO), что позволяет путешественникам получать более безопасный и удобный опыт",
};

const ch3_4 = {
  title: "Облачные технологии: всё под рукой",
  text: "Не забываем и про облачные технологии, которые делают взаимодействие с туристическими сервисами ещё более удобным. С помощью облачных платформ, таких как «DASH», отели и турсервисы могут лучше управлять своими базами данных и персонализировать обслуживание. Это позволяет гостиницам подстраиваться под предпочтения клиентов и гарантировать более высокий уровень обслуживания, а для туристов — удобство и безопасность.",
  image: DASH,
  // text: "Машинное обучение и искусственный интеллект активно используются для улучшения туристического сервиса. Например, рекомендательные системы, такие как «PathRec», анализируют туристические маршруты, предлагая пользователю лучшие варианты путешествий на основе его предпочтений и поведения. ИИ также применяются для создания голосовых помощников, таких как «KLM», который помогает пассажирам авиакомпаний подготовиться к поездке. Китайская платформа Fliggy, принадлежащая Alibaba Group, интегрируется с международными отельными сетями, такими как Marriott, и служит для продажи туристических продуктов, а также обработки транзакций через мобильные приложения и системы бронирования.",
};

const ch3_5 = {
  title: "Итак, что же ждёт нас впереди?",
  text: "Вся эта сложная и высокотехнологичная система, состоящая из блокчейна, ИИ, AR/VR и облачных решений, уже начинает активно менять туризм. Мы видим, как инновации становятся неотъемлемой частью путешествий, делая их более удобными, безопасными и персонализированными. В будущем технологии Web 3.0 будут играть ещё большую роль, и путешествия станут ещё более комфортными и технологичными.",
  image: Tourism,
  // text: "Облачные технологии также нашли своё применение в туристической сфере. Платформа «DASH» используется отелями для управления системой бронирования и клиентскими данными. Облачные решения позволяют улучшить работу с клиентами на основе их предпочтений, повысить безопасность личных данных и минимизировать административные задачи для сотрудников гостиниц.",
};

// const ch3_6 = {
//   title: "Будущее информационных технологий в туризме",
//   text: 'Будущее туризма будет определяться всё большим внедрением технологий, таких как ИИ, блокчейн, дополненная и виртуальная реальность, а также интернет вещей. Эти инновации значительно повысят безопасность путешествий, улучшат персонализацию услуг и сделают процесс организации путешествий более удобным и экономичным. Технологии Web 3.0 открывают новые горизонты для всей отрасли, делая её более автоматизированной и доступной для путешественников по всему миру.'
// };

const chapterThree = {
  title: title3,
  blocks: [ch3_1, ch3_2, ch3_3, ch3_4, ch3_5],
  isWhite: false,
};

const title4 = {
  titleName: "Заключение",
  titleSubName: "Влияние технологий на нашу жизнь",
  titleText:
    "Сегодня инфокоммуникационные и интернет-технологии захватывают все сферы нашей жизни. Особенно выделяются такие концепции, как «Индустрия 4.0» и «Web 3.0», которые меняют не только бизнес, но и повседневное существование людей.",
  titleImage: Title4,
};

const ch4_1 = {
  title: "Как меняются технологии и общество",
  // text: `В последние годы информационно-коммуникационные технологии и интернет меняют мир, и их влияние ощущается в каждой сфере жизни. Одними из самых перспективных направлений сегодня стали концепции «Индустрия 4.0» и «Web 3.0». Эти революционные подходы затрагивают не только производственные процессы, но и нашу повседневную жизнь, создавая новые возможности для бизнеса, экономики и даже для путешествий. Мы находимся на пороге новых открытий, которые, казалось бы, только вчера были фантастикой.`,
  text: "Концепции «Индустрия 4.0» и «Web 3.0» вносят огромные изменения в общественные и технологические процессы. Эти тренды дают толчок к появлению новых решений и внедрению инноваций во многих сферах жизни.",
  image: Web3Industry4,
};

const ch4_2 = {
  title: "Туризм в эпоху новых технологий",
  text: "Одной из самых ярких и интересных областей, где активно внедряются новые технологии, стал туризм. Виртуальная (VR), дополненная (AR) и смешанная реальность (MR) открывают безграничные возможности для создания уникальных путешествий, превращая каждый отпуск в незабываемое приключение.",
  // text: `Современные технологии, такие как искусственный интеллект, интернет вещей, блокчейн и дополненная реальность, становятся неотъемлемой частью нашего мира. И если мы говорим о туризме, то здесь технологии открывают совершенно новые горизонты. В рамках этого исследования мы подробно рассмотрели, как «Индустрия 4.0» и «Web 3.0» влияют на туризм и как эти технологии создают новые возможности для путешествий. Это не просто инновации, а настоящая трансформация всей отрасли.`,
  image: NewTour,
};

const ch4_3 = {
  title: "Как VR и AR меняют путешествия",
  // text: `Особое внимание заслуживают технологии дополненной (AR), виртуальной (VR) и смешанной реальности (MR), которые не только изменяют саму концепцию туризма, но и делают его гораздо более интересным и удобным. Теперь путешественники могут погружаться в виртуальные экскурсии, исследовать мир с помощью VR-очков или получать дополнительную информацию о достопримечательностях прямо на месте через AR-приложения. Виртуальные и дополненные туры становятся реальностью, открывая новые возможности для людей, которые не могут путешествовать физически.`,
  text: "Технологии виртуальной и дополненной реальности меняют сам подход к туризму. С их помощью путешествия становятся более увлекательными и персонализированными. Интерактивный опыт, который еще недавно казался невозможным, уже в доступе.",
  image: ArVrTourism,
};

const ch4_4 = {
  title: "Что нас ждет в будущем туризма",
  text: "Для туристической индустрии технологии VR и AR представляют собой настоящее будущее. Они не просто расширяют возможности взаимодействия с миром, но и делают каждое путешествие более доступным и увлекательным.",
  image: FutureTourism,
  // text: `Эти технологии значительно повышают качество обслуживания в туристической сфере, делая путешествия более персонализированными и удобными. Представьте, что, оказавшись в другом городе, вы сразу же можете получить информацию о всех интересных местах, музеях или ресторанах с помощью AR-приложений, а также виртуально посетить достопримечательности еще до поездки. Туризм становится интерактивным и захватывающим, а удобство пользователей выходит на новый уровень.`,
};

const ch4_5 = {
  title: "Новый взгляд на возможности технологий",
  text: `Технологии виртуальной и дополненной реальности, на мой взгляд, являются самыми важными в сфере туризма. Эти инновации не просто облегчают доступ к информации, они делают путешествия по-настоящему захватывающими. Мы уже можем посещать самые удаленные уголки планеты, не выходя из дома, или виртуально путешествовать по известным музеям и историческим местам. Эти технологии повышают вовлеченность клиентов, дают им возможность исследовать мир в своем собственном ритме, что значительно расширяет границы привычного туризма.`,
  image: NewView,
};

const ch4_6 = {
  title: "Заключение: Время перемен",
  text: "Развитие интернет-технологий и инфокоммуникаций открывает перед нами новые горизонты. Эти изменения делают мир более удобным, эффективным и интересным, а значит, будущее за ними.",
  image: Peremena,
  // text: `С каждым днем инфокоммуникационные технологии все больше меняют мир, и туристическая отрасль — не исключение. Виртуальная и дополненная реальности уже делают путешествия более доступными и интересными. Но это только начало. В будущем мы будем свидетелями того, как искусственный интеллект, блокчейн и другие передовые технологии будут работать на пользу путешественников и туристических компаний, улучшая качество обслуживания и предоставляя новые возможности. Прогресс не стоит на месте, и уже скоро мы сможем увидеть новые инновации, которые превратят наши путешествия в нечто по-настоящему уникальное.`,
};



const chapterFour = {
  title: title4,
  blocks: [ch4_1, ch4_2, ch4_3, ch4_4, ch4_5, ch4_6],
  isWhite: true,
};


const longread = [chapterOne, chapterTwo, chapterThree, chapterFour];

export { longread };
